#### 🖌 Terraform Format and Style ->`success`
#### ⚙️ Terraform Initialization ->`success`
#### 📖 Terraform Plan ->`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-escp-online]
azurerm_application_insights.ai: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-escp-online/providers/microsoft.insights/components/ai-espc-2021]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.ai will be created
  + resource "azurerm_application_insights" "ai" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + location                              = "germanywestcentral"
      + name                                  = "ai-espc-2021"
      + resource_group_name                   = "rg-espc-online"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "com.thorsten-hans.conference" = "ESPC2021"
          + "com.thorsten-hans.retention"  = "1-month"
        }
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "germanywestcentral"
      + name     = "rg-espc-online"
      + tags     = {
          + "com.thorsten-hans.conference" = "ESPC2021"
          + "com.thorsten-hans.retention"  = "1-month"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Author: @ThorstenHans, Action: `pull_request`*